                R S1TCDF                    PFILE(SETCDF)
     A          K S1FESO                    DESCEND
     A          K S1EMPR
     A          K S1SUCU
     A          K S1RAMA
     A          K S1POLI
     A          K S1SINI
     A          K S1NOPS
     A          K S1EMPD

